emacs-config.org
#+title: Emacs configuration
#+author: Witoslaw Koczewski
#+email: wi@koczewski.de
#+language: en
#+options: ':t toc:nil num:t author:t email:t
#+startup: content indent

* Templates

https://github.com/protesilaos/dotfiles/blob/master/emacs/.emacs.d/prot-emacs.org

* The early initialisation of Emacs (=early-init.el=)

This is the first file that Emacs reads when starting up. It should
contain code that does not depend on any package or the proportions of
the Emacs frame. In general, this early initialisation file is meant
to set up a few basic things before Emacs produces the initial frame
by delegating to the =init.el=.

** File header
#+begin_src emacs-lisp :tangle "stows/emacs/.config/emacs/early-init.el"
;;; early-init.el --- Tangeled from emacs-config.org  -*- lexical-binding: t; -*-
#+end_src

** Tweaks for performance

#+begin_src emacs-lisp :tangle "stows/emacs/.config/emacs/early-init.el"
  ;;; Tweaks for performance

  (setq load-prefer-newer t)
  (setq native-comp-speed 2)
  (setq read-process-output-max (* 1024 1024))
  (setq max-lisp-eval-depth 16000)
  (setq max-specpdl-size 25000)

  ;; Temporarily increase the garbage collection threshold.
  (setq gc-cons-threshold most-positive-fixnum
        gc-cons-percentage 0.5)

  (defvar my/--file-name-handler-alist file-name-handler-alist)
  (defvar my/--vc-handled-backends vc-handled-backends)

  (setq file-name-handler-alist nil
        vc-handled-backends nil)

  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq gc-cons-threshold (* 50 1024 1024) ;; 50MB
                    gc-cons-percentage 0.1
                    file-name-handler-alist my/--file-name-handler-alist
                    vc-handled-backends my/--vc-handled-backends)))
#+end_src

** Elpaca (disabled)

Elpaca requires to disable =package.el=.
https://github.com/progfolio/elpaca/blob/master/doc/manual.md#installation-requirements

#+begin_src emacs-lisp :NOtangle "stows/emacs/.config/emacs/early-init.el"
  ;;; Elpaca
  (setq package-enable-at-startup nil)
#+end_src

** Package

#+begin_src emacs-lisp :tangle "stows/emacs/.config/emacs/early-init.el"
  ;;; package

  (require 'package)
  (setq package-enable-at-startup t)
  (add-to-list 'package-archives '("stable" . "https://stable.melpa.org/packages/"))
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))

#+end_src

** Frames

Disable menu, toolbars and scrollbars.

#+begin_src emacs-lisp :tangle "stows/emacs/.config/emacs/early-init.el"
;;; Frames

(menu-bar-mode -1)
(scroll-bar-mode -1)
(add-hook 'emacs-startup-hook
          (lambda ()
            (tool-bar-mode -1)))
#+end_src

These are some general settings for frames.

#+begin_src emacs-lisp :tangle "stows/emacs/.config/emacs/early-init.el"
(setq frame-resize-pixelwise t
      frame-inhibit-implied-resize 'force
      frame-title-format '("%b")
      ring-bell-function 'ignore
      use-dialog-box t ; only for mouse events, which I seldom use
      use-file-dialog nil
      use-short-answers t
      inhibit-splash-screen t
      inhibit-startup-screen t
      inhibit-x-resources t
      inhibit-startup-echo-area-message user-login-name ; read the docstring
      inhibit-startup-buffer-menu t)
#+end_src

Open frames in fullscreen.
https://www.emacswiki.org/emacs/FullScreen

#+begin_src emacs-lisp :tangle "stows/emacs/.config/emacs/early-init.el"
(push '(fullscreen . maximized) default-frame-alist)
#+end_src

** Theme

#+begin_src emacs-lisp :tangle "stows/emacs/.config/emacs/early-init.el"
;;; Theme
(load-theme 'modus-vivendi-tinted) 
#+end_src

* The main initialisation of Emacs (=init.el=)
** File header

#+begin_src emacs-lisp :tangle "stows/emacs/.config/emacs/init.el"
;;; init.el --- Tangeled from emacs-config.org  -*- lexical-binding: t; -*-
#+end_src

** Emacs behavior
*** Elpaca (disabled)

https://github.com/progfolio/elpaca/blob/master/doc/manual.md

#+begin_src emacs-lisp :NOtangle "stows/emacs/.config/emacs/init.el"
  ;;; Elpaca

  (defvar elpaca-installer-version 0.11)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order
    '(elpaca :repo "https://github.com/progfolio/elpaca.git"
             :ref nil :depth 1 :inherit ignore
             :files (:defaults "elpaca-test.el" (:exclude "extensions"))
             :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (<= emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                    ((zerop
                      (apply
                       #'call-process
                       `("git" nil ,buffer t "clone"
                         ,@(when-let* ((depth (plist-get order :depth)))
                             (list (format "--depth=%d" depth) "--no-single-branch"))
                         ,(plist-get order :repo) ,repo))))
                    ((zerop (call-process "git" nil buffer t "checkout"
                                          (or (plist-get order :ref) "--"))))
                    (emacs (concat invocation-directory invocation-name))
                    ((zerop (call-process
                             emacs nil buffer nil "-Q" "-L" "." "--batch"
                             "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                    ((require 'elpaca))
                    ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (let ((load-source-file-function nil))
        (load "./elpaca-autoloads"))))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))

  (elpaca elpaca-use-package
    (elpaca-use-package-mode))
#+end_src

*** Disable Emacs Custom Infrastructure

#+begin_src emacs-lisp :tangle "stows/emacs/.config/emacs/init.el"
(setq custom-file (make-temp-file "emacs-custom-"))
#+end_src

*** Disable backups and lockfiles


#+begin_src emacs-lisp :tangle "stows/emacs/.config/emacs/init.el"
(setq make-backup-files nil)
(setq backup-inhibited nil)
(setq create-lockfiles nil)
#+end_src

*** Silence native compilation

#+begin_src emacs-lisp :tangle "stows/emacs/.config/emacs/init.el"
(when (native-comp-available-p)
  (setq native-comp-async-report-warnings-errors 'silent)
  (setq native-compile-prune-cache t))
#+end_src

