emacs-config.org
**** Commons

#+begin_src emacs-lisp :tangle "stows/emacs/.config/emacs/init.el"
(defun my/ai-prompt-file (filename)
  (expand-file-name (concat "/p/orga/ai/prompts/" filename) user-emacs-directory))
#+end_src

**** Gptel

https://github.com/karthink/gptel

#+begin_src emacs-lisp :tangle "stows/emacs/.config/emacs/init.el"
  (defun my/ai-gptel-load-directive-from-markdown (file)
    "Load a gptel directive from a markdown FILE.
  Returns a cons of (name . directive) where name is derived from filename
  and directive is the content of the file."
    (condition-case err
        (let ((max-specpdl-size (* 10 max-specpdl-size)) ; Increase recursion limit
              (max-lisp-eval-depth (* 10 max-lisp-eval-depth))
              (large-file-warning-threshold nil) ; Disable large file warning
              (gc-cons-threshold (* 100 1024 1024))) ; 100MB for GC threshold
          (with-temp-buffer
            ;; Temporarily increase buffer size limit for this operation
            (let ((enable-local-variables nil)
                  (buffer-read-only nil)
                  (buffer-file-name nil)
                  (max-mini-window-height 0.5))
              (insert-file-contents file)
              (let* ((filename (file-name-nondirectory file))
                     (name (intern (car (split-string filename "\\.md"))))
                     (content (buffer-substring-no-properties
                               (point-min)
                               (point-max))))
                (cons name (string-trim content))))))
      (error
       (message "Error loading directive from %s: %s"
                file (error-message-string err))
       nil)))

  (defun my/ai-gptel-load-all-markdown-directives (directory)
    "Load all markdown files from DIRECTORY as gptel directives.
  Returns a list of cons cells (name . directive) for each .md file."
    (when (file-directory-p directory)
      (let ((markdown-files (directory-files directory t "\\.md$")))
        (delq nil
              (mapcar #'my/ai-gptel-load-directive-from-markdown markdown-files)))))

  (defun my/gptel-make-tools ()

    (gptel-make-tool
     :name "emacs_eval"
     :description "Evaluate Emacs Lisp Code inside the running Emacs"
     :function (lambda (code)
                 (read "(progn 1 2)")
                 (eval
                  (read
                   (concat "(progn " code ")"))))
     :args (list '(:name "elisp_code"
                         :type "string"
                         :description "The Emacs Lisp Code to evaluate"))
     :confirm t
     :include nil
     :category "emacs")

    (gptel-make-tool
     :name "fetch"
     :description "Fetch and read the contents of a URL"
     :function (lambda (url)
                 (with-current-buffer (url-retrieve-synchronously url)
                   (goto-char (point-min)) (forward-paragraph)
                   (let ((dom (libxml-parse-html-region (point) (point-max))))
                     (run-at-time 0 nil #'kill-buffer (current-buffer))
                     (with-temp-buffer
                       (shr-insert-document dom)
                       (buffer-substring-no-properties (point-min) (point-max))))))
     :args (list '(:name "url"
                         :type "string"
                         :description "The URL to read"))
     :category "web")

    ;; (gptel-make-tool
    ;;  :function
    ;;  (lambda ()
    ;;    (if-let* ((proj (project-current))
    ;;              (root (project-root proj)))
    ;;        (let ((root-path (expand-file-name root)))
    ;;          (format "Project root directory: %s\nDirectory exists: %s\nIs directory: %s"
    ;;                  root-path
    ;;                  (file-exists-p root-path)
    ;;                  (file-directory-p root-path)))
    ;;      "No project found in the current context."))
    ;;  :name "get_project_root"
    ;;  :description "Get the root directory of the current project. This is useful for understanding the project structure and performing operations relative to the project root."
    ;;  :args nil
    ;;  :category "project")

    (gptel-make-tool
     :name "read_file"
     :description "Read and display the contents of a file"
     :function (lambda (filepath)
  	       (with-temp-buffer
  	         (insert-file-contents (expand-file-name filepath))
  	         (buffer-string)))
     :args (list '(:name "filepath"
  	               :type "string"
  	               :description "Path to the file to read.  Supports relative paths and ~."))
     :category "filesystem")

    (gptel-make-tool
     :name "list_project_files"
     :description "List programming files in the current project directory. Use this function to understand which files you want to read so you can better understand the request from the user."
     :function
     (lambda (&optional file-regex)
       (if-let* ((proj (project-current))
                 (root (project-root proj))
                 (default-regex "\\.\\(el\\|clj\\|cljs\\|cljc\\|js\\|jsx\\|ts\\|tsx\\|rb\\|py\\|go\\|rs\\|cpp\\|c\\|h\\|hpp\\|java\\|php\\)$")
                 (regex (or file-regex default-regex))
                 (files (project-files proj)))
           (let ((matching-files
                  (cl-remove-if-not
                   (lambda (file)
                     (string-match-p regex (file-relative-name file root)))
                   files)))
             (concat "Project root: " (abbreviate-file-name root) "\n"
                     "Files:\n"
                     (mapconcat
                      (lambda (file)
                        (concat "- " (file-relative-name file root)))
                      matching-files
                      "\n")))
         "No project found or no matching files."))
     :args (list '(:name "file_regex"
                         :type "string"
                         :description "Optional regex pattern to filter files (e.g., \"\\.py$\" for Python files). If not provided, lists common programming files."))
     :category "project")
    
    )


  (use-package gptel
    :ensure t
    :defer t
          
    :config
          
    (setq gptel-model `deepseek-chat)
    (setq gptel-temperature 0.7)
    (setq gptel-window-select t)
    (setq gptel-window-side 'right)
    (setq gptel-window-width 80)

    (setq gptel-default-mode 'org-mode)
    (setq gptel-org-branching-context nil)
    (setf (alist-get 'org-mode gptel-prompt-prefix-alist) "# user: ")
    (setf (alist-get 'org-mode gptel-response-prefix-alist) "# llm:\n\n")

    (add-hook 'gptel-post-stream-hook 'gptel-auto-scroll)
    (add-hook 'gptel-post-response-functions 'gptel-end-of-response)
          
    (setq gptel-api-key (auth-source-pass-get 'secret "openai-emacs"))
          
    (setq gptel-backend
          (gptel-make-anthropic "Claude"
            :stream t
            :key (auth-source-pass-get 'secret "anthropic-emacs")))
    ;; (setq gptel-model `claude-3-haiku-20240307)

    (setq gptel-backend
          (gptel-make-openai "DeepSeek"
            :host "api.deepseek.com"
            :endpoint "/chat/completions"
            :stream t
            :key (auth-source-pass-get 'secret "deepseek-emacs")
            :models '(deepseek-chat deepseek-coder)))
          
    (setq gptel-directives
          (let ((markdown-directives (my/ai-gptel-load-all-markdown-directives (expand-file-name "prompts" user-emacs-directory))))
            `(
              ,@markdown-directives
              )))

    ;; my/gptel-menu command
    (defun my/gptel-menu ()
      (interactive)
      (meow-insert-exit)
      (gptel-menu)
      )

    ;; my/gptel-scratch command
    (setq my/gptel-scratch-buffer-name "*gptel-scratch*")
    (defun my/ai-chat ()
      (interactive)
      (let ((buffer-name (concat
                          "*gptel-chat "
                          (format-time-string "%Y-%m-%d %H:%M:%S")
                          "*")))
        (progn
          (gptel buffer-name)
          (switch-to-buffer buffer-name)
          )
        )
      ;; (if (not (get-buffer my/gptel-scratch-buffer-name))
      ;;     (gptel my/gptel-scratch-buffer-name))
      ;; (switch-to-buffer my/gptel-scratch-buffer-name)
      )

    (defun my/ai-emacs-do ()
      "Execute the users request in emacs"
      (interactive)

      ;; tool
      (let ((emacs-eval-tool
             (gptel-make-tool
              :name "emacs_eval"
              :function (lambda (code)
                          (condition-case err
                              (let ((result (eval (read code))))
                                (format "Evaluation result: %S" result))
                            (error (format "Error: %s" (error-message-string err)))))
              :description "Evaluate Emacs Lisp code and return the result"
              :args '((:name "code"
                             :type "string"
                             :description "Emacs Lisp code to evaluate")))))
                
        ;; Add tool to gptel-tools and enable tool use
        (setq-local gptel-tools (list emacs-eval-tool))
        (setq-local gptel-use-tools t)
        )

      ;; system prompt
      (setq-local gptel--system-message "You are a helpful assistant living inside Emacs.
          Use the emacs_eval tool to fullfill the request of the user.")
            
      ;; user prompt and execution
      ;; (let ((prompt (gptel--read-minibuffer-prompt)))
      ;;   (call-interactively #'gptel-menu))

      (gptel--suffix-send '("m" "e"))
      )
          
    (my/gptel-make-tools)
           
    :bind
    ("M-<return>" . my/gptel-menu)
    ("C-c a i c" . my/ai-chat)
    ("C-c a i d" . my/ai-emacs-do)
          
    )
#+end_src

**** Elysium

https://github.com/lanceberge/elysium

#+begin_src emacs-lisp :tangle "stows/emacs/.config/emacs/init.el"
(use-package elysium
  :ensure t
  :defer t
  )
#+end_src

**** Aidermacs

https://github.com/MatthewZMD/aidermacs

#+begin_src emacs-lisp :tangle "stows/emacs/.config/emacs/init.el"
  (use-package aidermacs
    :ensure t
    :defer t
    ;; :bind (("C-c a" . aidermacs-transient-menu))
    
    :init
    (setq aidermacs-use-architect-mode t)
    (setq aidermacs-default-model "deepseek-coder"))
#+end_src

**** Efrit (disabled)

#+begin_src emacs-lisp :NO-tangle "stows/emacs/.config/emacs/init.el"
  ;;; efrit

  (add-to-list 'load-path "/p/efrit/lisp")

  (use-package efrit
    ;; :ensure t
    :init
    (setq efrit-data-directory "~/.config/emacs/efrit")

    (defun efrit-common-get-api-key ()
      "Get the Anthropic API key from pass."
      (auth-source-pass-get 'secret "anthropic-emacs"))
    
    )

#+end_src

** Legacy config

#+begin_src emacs-lisp :tangle "stows/emacs/.config/emacs/init.el"


(let ((custom-modules (expand-file-name "custom-modules" user-emacs-directory)))
  (when (file-directory-p custom-modules)
    (message "adding custom-modules to load-path: %s" custom-modules)
    (add-to-list 'load-path custom-modules)))

(require 'my-commands)
(require 'my-basics)
(require 'my-extras)
(require 'my-org)
(require 'my-lsp)
;; (require 'my-eglot)
;; (require 'my-email)
#+end_src
** Open =emacs-config.org= on startup

#+begin_src emacs-lisp :tangle "stows/emacs/.config/emacs/init.el"
  (add-hook 'after-init-hook
            (lambda ()
              (find-file "~/.dotfiles/emacs-config.org")))
#+end_src

** TEMPLATE

#+begin_src emacs-lisp :tangle "stows/emacs/.config/emacs/init.el"

#+end_src


