stows/emacs/.config/emacs/init.el

(let ((custom-modules (expand-file-name "custom-modules" user-emacs-directory)))
  (when (file-directory-p custom-modules)
    (message "adding custom-modules to load-path: %s" custom-modules)
    (add-to-list 'load-path custom-modules)))

(require 'my-commands)
(require 'my-basics)
(require 'my-extras)
(require 'my-org)
(require 'my-ai)
(require 'my-lsp)
;; (require 'my-eglot)
;; (require 'my-email)

(add-hook 'elpaca-after-init-hook
          (lambda ()
            (find-file "~/.dotfiles/emacs-config.org")))


